<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SoulSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */







    public function run(): void
    {
        DB::table('soul')->insert([
            [
                'group_name' => 'soul',
                'number' => 1,
                'text' => 'Душа пришла обучиться лидерским качествам, вдохновлять, вести людей, сиять. Когда это реализовано, люди хотят брать пример, чувствуют, интересуются. Учит сдаваться Божественной воле. Постоянное движение вперед. Энергия воина.'
            ],
            [
                'group_name' => 'soul',
                'number' => 2,
                'text' => 'Такие люди часто рождаются в семьях, где родители не умеют проявлять любовь. Человек испытывает недостаток любви и начинает заслуживать любовь, искать ее. Программа – быть хорошим для всех. Задача – открыть любовь к себе, без осуждений. До этих пор человек будет наступать на горло себе и своим потребностям.'
            ],
            [
                'group_name' => 'soul',
                'number' => 3,
                'text' => 'Душа выбрала творить и жить в изобилии и процветании. Человек пришел научиться быть творческим, проявить свой Высший потенциал. Задача - видеть Высший потенциал творения и предпринимать конкретные действия для осуществления Мечты. Если человек не сонастроен с Лучом, он может навязывать свою точку зрения, быть критичным, эгоистичным, гордиться своим интеллектом.'
            ],
            [
                'group_name' => 'soul',
                'number' => 4,
                'text' => 'Душа выбрала быть целителем, принести гармонию в этот мир через создание гармонии в себе, научиться соединяться с духом планеты на глубинном уровне. Девиз «Мир, дружба, жвачка». Оборотная сторона: человек учится гармонизировать и балансировать, значит он неизбежно встретится с конфликтными ситуациями, с энергией хаоса, которые нужно научиться разрешать. Задача-научиться проходить через конфликты, не бояться их. Найти свои ключи к разрешению конфликтов. Такие люди любят находится в гармоничном пространстве, четко видят нестыковки, конфликтные энергии. Им хорошо быть с теми, кто их почитает, видит в них хорошее. Свои силы они восстанавливают на природе, хорошо жить в загородном доме. Необходимо освободиться от попыток кого-то изменить.'
            ],
            [
                'group_name' => 'soul',
                'number' => 5,
                'text' => 'Душа хочет соединиться с Высшими Знаниями. Эти люди ищут ответы на все свои вопросы. У них всегда много вопросов и они хотят найти на них ответы. Обладатели сильного ума. Это искатели, ученики по жизни. Но Ум не дает пойти за пределы Высшего знания. Задача - выстроить отношения с умом, чтобы ум не мешал соединению с Духом. В сопротивлении к Лучу, могут застревать в вопросах ума и уходить от Истины.'
            ],
            [
                'group_name' => 'soul',
                'number' => 6,
                'text' => 'Душа пришла признать свою Божественность. Склонность к идеализму и перфекционизму. Требовательность к себе и другим. Я должна быть совершенной чтобы меня любили. Я должна быть идеальной, чтобы понравиться Богу, обществу, партнеру, родителям…Чувство стыда за не идеальность, страх публичных выступлений. Очень сильная критика себя, осуждение себя. Большая серьезность ко всему, склонность к драме. Могут быть тиранами. Фанатизм в увлечениях, деление людей на плохих и хороших. Ранний поиск духовных практик, Душа подталкивает к соединению с Божественным. Урок Души– Бог нас любит безусловно. Я божественно ошибаюсь и Бог не любит меня меньше от этого. Все божественно, освобождаться от необходимости совершенствоваться, отпускать осуждения и чувство отделенности. Мое творчество божественно! (туалет). Все что я воспроизвожу-совершенно!'
            ],
            [
                'group_name' => 'soul',
                'number' => 7,
                'text' => 'Человек очень любит перемены, все новое и обязательно придет к духовной практике или уже стоит на пороге. Душа пришла по 7-му лучу-лучу алхимии и трансформации получать новый опыт, сакральные знания и научиться отпускать привязанности. Человек с 7-м лучом в Душе зачастую нетерпелив, ему сложно уважать цикличности. Желание познавать новое движет им и приводит к тому, человек постоянно куда-то бежит, торопится, но не хочет долго ждать результата и не дает себе времени на интеграцию. Если 7 в генетике. Душа рвется в новые трансформации, но родовые программы «держат за хвост». Душа пришла разобрать родовую карму. Это означает, что, разрешая себе трансформироваться, меняться, идти духовным путем, принося трансформацию в свою жизнь и открываясь новому, я открываю свои родовые каналы новому. Потому что здесь стоит на это запрет. Есть строгие суждения и консервативные взгляды в семье по поводу открытия чего-то нового что это опасного. Могут быть фобии и страхи.'
            ],
            [
                'group_name' => 'monada',
                'number' => 1,
                'text' => 'Возможно, власть и сила были неэкологично использованы в прошлых жизнях и теперь Душа пришла научиться использовать силу через групповое сознание. Если сложно или страшно быть лидером и проявляться, то в этой жизни обучение по 1-му Лучу несет утяжеление. Важно не бояться проявляться и в соединении с Божественной Волей вести за собой людей.'
            ],
            [
                'group_name' => 'monada',
                'number' => 2,
                'text' => 'Первое групповое сознание, с которым встречается человек - это родители. Возможно недолюбили в детстве или казалось, что получили недостаточно любви от родителей, семья не умела проявлять любовь. Есть программа из детства, что любовь нужно заслужить, нужно что-тот сделать, чтобы меня любили. Задача- открыть любовь в себе. Пока это не произойдет, человек будет разрушать себя, доказывая, что он достоин любви. Самый важный урок- принять и полюбить себя. Развернись и откройся Любви. Вызов-полюбить себя. Важно найти партнера на уровне Души-это глубокое принятие, любовь и поддержка. И это на самом деле поиск внутри себя. Открыться этому внутри и тогда не нужно искать вовне.'
            ],
            [
                'group_name' => 'monada',
                'number' => 3,
                'text' => 'Человеку сложно проявиться творчески, выразить свой талант и реализовать его в жизни. Есть убеждение, что я не смогу, у меня не получится. Родители в детстве могли говорить, что «руки не из того места растут» и т.п. Задача-заявить свою Истину, увидеть возможности там, где их не видят другие и реализовать их в групповом сознании.'
            ],
            [
                'group_name' => 'monada',
                'number' => 4,
                'text' => 'Люди, которые пришли менять групповое сознание Земли, работать с человечеством. Хорошо быть с теми, кто вас почитает, в пространстве тех, кто видит в вас хорошее. Рекомендовано целительство, эти люди приносят гармонию большим группам людей. Возможно, в детстве, было ощущение «белой вороны» в какой-то группе (класс, кружок…), когда не принимал коллектив. Могут не хотеть/бояться работать с группами. Это их вызов. Этот луч освобождает от попыток кого-то изменить.'
            ],
            [
                'group_name' => 'monada',
                'number' => 5,
                'text' => 'Возможно, в детстве окружение заставляло сомневаться в себе, лишало уверенности в своих знаниях. Но благодаря этому, человек встал на путь трансформации, путь новых знаний и интеграции их в жизнь. Важно найти ответы на вопросы. Больше доверия себе- мудрость внутри меня. Теневая сторона- получить доказательства. Групповое сознание учит проявлять свою интуицию тем, что не доверяет и требует доказательств. Важно доверять своей интуиции, уйти от внешнего. Недоверие собственной мудрости. Есть убеждение, что кто-то знает лучше, чем я. Не надо искать кого-то кто расскажет нам как, т.е. ставить авторитет других выше собственного. Может быть убеждение, что ценно только материальное и сложно ценить тонкое пространство, пространство тайны. Блокирует проявленность в Духе, потому что все время требует доказательств. Ум очень сильно блокирует связь с Духом, обесценивает эти знания. Нужно открыться Высшему Уму, Тайне жизни.'
            ],
            [
                'group_name' => 'monada',
                'number' => 6,
                'text' => 'В прошлых воплощениях был религиозный фанатизм, следование догмам, видение всего в двойственности. Узколобость, следование догмам. Возможно, родители были очень требовательны к ребенку. Урок - все пути ведут к Богу. Все пути Божественны, Божественен я сам. Пока человек не сонастроен с этим лучом, он будет искать личного Бога или Божество для посвящения себя, пока не обнаружит, что он уже божественен и Бог находится внутри него. Часто такие люди полагают, что должны быть совершенными, чтобы быть божественными. Задача: научиться видеть Божественное во всем и в групповом сознании (в семье, какой-либо группе). Принять свою семью/группу/ коллектив через ваш любящий аспект как Божественное. Все находится в своей Божественной Истине согласно Божественному плану, который постоянно развивается и меняется. Учиться чистоте сердца, невинности ума, принятию, смирению и балансу.'
            ],
            [
                'group_name' => 'monada',
                'number' => 7,
                'text' => 'Могут быть убеждения и сопротивления, фобии и страхи. Для их преодоления нужно меняться и трансформироваться. Люди, у которых в карте семерки, обязательно придут к духовным практикам в своей жизни. Могут быть сопротивления на пути к духовным практикам. Такой человек любит путешествовать, обновлять гардероб, изменять пространство. Если что-то не так, то я это поменяю!'
            ],
            [
                'group_name' => 'genetic_body',
                'number' => 1,
                'text' => 'Возможно, в роду была программа контроля. Человек контролирует себя, контролирует других и ему сложно довериться. Имеют место убеждения, что только мое мнение правильное. Задача - принимать все таким, каким оно является. Соединить свою Свободную волю с Божественной. Может давать такой фон, что мне не хватит сил. Дар Роду- принести Божественный план, открыть ему, что существует Божественная Воля.'
            ],
            [
                'group_name' => 'genetic_body',
                'number' => 2,
                'text' => 'Душа выбрала принести в дар своему роду принятие себя и других людей без условий, безусловную любовь. Возможно, в роду было такое, что женщины, может быть мама, не ценили себя, отдавали все свое внимание детям. Возможно, мужчины в роду подавляли женщин и обесценивали их труд. Есть убеждения, что любовь нужно заслужить. Задача – соединиться со своим сердцем, дать возможность заниматься собой, показывая тем самым своему роду, что возможно не заслуживать любовь служа всем, а наполнить этой любовью себя и пропускать через себя эту любовь. Дар Роду – принимать, почитать и ценить себя и принимать всех такими какие они есть.'
            ],
            [
                'group_name' => 'genetic_body',
                'number' => 3,
                'text' => 'Душа выбрала творить и жить в изобилии и процветании. Человек пришел научиться быть творческим, проявить свой Высший потенциал. Задача - видеть Высший потенциал творения и предпринимать конкретные действия для осуществления Мечты. Если человек не сонастроен с Лучом, он может навязывать свою точку зрения, быть критичным, эгоистичным, гордиться своим интеллектом.'
            ],
            [
                'group_name' => 'genetic_body',
                'number' => 4,
                'text' => 'Душа выбрала принести гармонию в этот мир через создание гармонии в себе, научиться соединяться с духом планеты на глубинном уровне. Девиз «Мир, дружба, жвачка». Оборотная сторона: человек учится гармонизировать и балансировать, значит он неизбежно встретится с конфликтными ситуациями, с энергией хаоса, которые нужно научиться разрешать. Задача-научиться проходить через конфликты, не бояться их. Найти свои ключи к разрешению конфликтов. Такие люди любят находится в гармоничном пространстве, четко видят нестыковки, конфликтные энергии. Им хорошо быть с теми, кто их почитает, видит в них хорошее. Свои силы они восстанавливают на природе, хорошо жить в загородном доме. Необходимо освободиться от попыток кого-то изменить.'
            ],
            [
                'group_name' => 'genetic_body',
                'number' => 5,
                'text' => 'Душа хочет соединиться с Высшими Знаниями. Эти люди ищут ответы на все свои вопросы. У них всегда много вопросов и они хотят найти на них ответы. Обладатели сильного ума. Это искатели, ученики по жизни. Но Ум не дает пойти за пределы Высшего знания. Задача - выстроить отношения с умом, чтобы ум не мешал соединению с Духом. В сопротивлении к Лучу, могут застревать в вопросах ума и уходить от Истины.'
            ],
            [
                'group_name' => 'genetic_body',
                'number' => 6,
                'text' => 'Душа пришла признать свою Божественность. Склонность к идеализму и перфекционизму. Требовательность к себе и другим. Я должна быть совершенной чтобы меня любили. Я должна быть идеальной, чтобы понравиться Богу, обществу, партнеру, родителям…Чувство стыда за не идеальность, страх публичных выступлений. Очень сильная критика себя, осуждение себя. Большая серьезность ко всему, склонность к драме. Могут быть тиранами. Фанатизм в увлечениях, деление людей на плохих и хороших. Ранний поиск духовных практик, Душа подталкивает к соединению с Божественным. Урок Души– Бог нас любит безусловно. Я божественно ошибаюсь и Бог не любит меня меньше от этого. Все божественно, освобождаться от необходимости совершенствоваться, отпускать осуждения и чувство отделенности. Мое творчество божественно! Все что я воспроизвожу-совершенно!'
            ],
            [
                'group_name' => 'genetic_body',
                'number' => 7,
                'text' => 'Человек очень любит перемены, все новое и обязательно придет к духовной практике или уже стоит на пороге. Душа пришла по 7-му лучу-лучу алхимии и трансформации получать новый опыт, сакральные знания и научиться отпускать привязанности. Человек с 7-м лучом в Душе зачастую нетерпелив, ему сложно уважать цикличности. Желание познавать новое движет им и приводит к тому, человек постоянно куда-то бежит, торопится, но не хочет долго ждать результата и не дает себе времени на интеграцию. Если 7 в генетике. Душа рвется в новые трансформации, но родовые программы «держат за хвост». Душа пришла разобрать родовую карму. Это означает, что, разрешая себе трансформироваться, меняться, идти духовным путем, принося трансформацию в свою жизнь и открываясь новому, я открываю свои родовые каналы новому. Потому что здесь стоит на это запрет. Есть строгие суждения и консервативные взгляды в семье по поводу открытия чего-то нового что это опасного. Могут быть фобии и страхи.'
            ],
            [
                'group_name' => 'emotional_body',
                'number' => 1,
                'text' => 'Человек контролирует свои эмоции, тяжело их выражать, тяжело проявляться. Воспринимают свою эмоциональность как слабость. Любят копить свои эмоции пока не взорвутся. Эмоции копятся. Важно их выражать, проговаривать, выражать свою эмоцию словами и тогда эта энергия не застревает в теле, мы не болеем или не копится пока не выльется на кого-то кто под руку попал. Невыраженные эмоции - это путь к болезням.'
            ],
            [
                'group_name' => 'emotional_body',
                'number' => 2,
                'text' => 'Западание в эмоциях, что меня не любят.'
            ],
            [
                'group_name' => 'emotional_body',
                'number' => 3,
                'text' => 'Это Луч проявленности мечты в реальности. Присутствуют артистические способности. Балансировать эмоции хорошо через деланье руками. Сонастраивается низший и Высший ум. Можно вязать, шить, рисовать, петь, танцевать и т.д. Через творчество сонастраиваемся с Божественным потоком. Когда мы что-то не позволяем себе, сразу чувствуем зажим-спазм в солнечном сплетении. Когда уютно и комфортно, эмоциональное тело расслаблено. Нравится быть в потоке и приносить новые идеи.'
            ],
            [
                'group_name' => 'emotional_body',
                'number' => 4,
                'text' => 'Этот Луч характеризует человека как избегающего конфликтных ситуаций. Ему комфортно, когда нет конфликтов. Худой мир лучше доброй ссоры. Конфликт приводит к опустошению. Эмоциональное тело радуется, когда получает ответы на вопросы.'
            ],
            [
                'group_name' => 'emotional_body',
                'number' => 5,
                'text' => 'Свои эмоции мы принимаем через ум. Немного поменьше рассуждений. Когда происходит какая-то эмоциональная встряска, начинаем придумывать, передумывать, уходим в ум. Не нагнетать, не надумывать и не идти сразу в анализ. Немного отпускаем, даем Вселенной себя удивить.'
            ],
            [
                'group_name' => 'emotional_body',
                'number' => 6,
                'text' => 'Человек склонен к перфекционизму, настроен на результат. Человеку приятно видеть красоту, это его радует. Люди-эстеты. Может переживать из-за несовершенства чего-либо и расстраиваться. Задача-видеть и приносить в мир красоту и радоваться этому.'
            ],
            [
                'group_name' => 'emotional_body',
                'number' => 7,
                'text' => 'Показывает, что человек радуется новому, переменам. Но эмоции и настроение могут быть очень изменчивыми. Человек очень ценит свои эмоции, полученные в духовных практиках. Очень хорошо медитировать.'
            ],
            [
                'group_name' => 'physical_body',
                'number' => 1,
                'text' => 'Очень большой ресурс в физическом теле. Такие люди любят проверять себя на прочность. Лидерское начало. Задача - принять других какие они есть. Не мешать другим. Есть желание контролировать жизнь других.'
            ],
            [
                'group_name' => 'physical_body',
                'number' => 2,
                'text' => 'Могут быть проблемы в партнерских отношениях, так как кажется, что партнер недостаточно любит, не дает тепла. Фокус на том, что очень важно находится в любящем пространстве, общаться с теми людьми, которые любят. Может быть фокус что кто-то не любит-он отражает то, что какая-то часть человека не любит и не принимает себя. Возможно отсутствие одного из родителей.'
            ],
            [
                'group_name' => 'physical_body',
                'number' => 3,
                'text' => 'Творческое пространство вокруг, возможно необычный дом, креативный дизайн. Пространство должно быть комфортным, уютным и творческим. «С милым рай и в шалаше» - не про этого человека.'
            ],
            [
                'group_name' => 'physical_body',
                'number' => 4,
                'text' => 'Человек любит гармоничное пространство, все натуральное, естественное, соединенное с природой. Хорошо жить в доме на природе. Пространство гармонично, если окружающие люди поддерживают мою гармонию и баланс. Человек встретится с конфликтами, придется сказать свое мнение.'
            ],
            [
                'group_name' => 'physical_body',
                'number' => 5,
                'text' => 'Человек в поисках истины. Интересно находиться среди знающих людей.'
            ],
            [
                'group_name' => 'physical_body',
                'number' => 6,
                'text' => 'Перфекционизм по поводу своего тела. Любят красиво одеваться, следят за собой. Важна физическая нагрузка. Если не в балансе-непринятие своего тела, страх старости, смерти, может быть зацикленность на своем внешнем виде. Обычно это хорошие работники, но и от других они требуют идеального выполнения работы. Задача-принять себя и свое тело как идеал.'
            ],
            [
                'group_name' => 'physical_body',
                'number' => 7,
                'text' => 'Человек хорошо чувствует себя, когда вокруг перемены, когда путешествует, встречается с новыми людьми. Этот человек не домосед. В сопротивлении к лучу, человек посадил себя в «коробочку», сидит дома, не двигается. Тогда энергия затухает, становится тухлой, человек чувствует себя хуже. Энергия должна постоянно двигаться, трансформироваться, чтобы телу было хорошо. 7-ка может давать такое, что нужно постоянно куда-то бежать, торопиться, набирать, набирать… Вдох, вдох, жизнь на вдохе. Нужно периодически притормаживать, чтобы сделать выдох и позволить энергии интегрироваться.'
            ],
            [
                'group_name' => 'ego',
                'number' => 1,
                'text' => 'Человек хочет, чтобы все всегда видели его «на коне», чтобы не происходило в жизни. Важно сдаваться Божественной воле и принимать.'
            ],
            [
                'group_name' => 'ego',
                'number' => 2,
                'text' => 'Человек хочет казаться любящим, «белым и пушистым». Такой хитрый ход Эго. Это создает подавление своей теневой стороны, в которой прячется очень большая сила. И нужно ее доставать и на нее посмотреть. Бывает сложно говорить нет.'
            ],
            [
                'group_name' => 'ego',
                'number' => 3,
                'text' => 'Человек хочет, чтобы его видели творческим, успешным и процветающим. Часто это художники, дизайнеры, люди творческих профессий. Творческий луч ищет все возможности, использует их в жизни. Важно, чтобы мир видел этого человека творческим. Я хочу быть процветающим человеком и я буду все для этого делать.'
            ],
            [
                'group_name' => 'ego',
                'number' => 4,
                'text' => 'Человек хочет избежать конфликта любой ценой. Эго пытается понравиться другим, показать, что я не конфликтный человек и хочу все решить мирным путем. Но когда человек избегает конфликт и не выражает свое мнение, он опять наступает на свое Я ради того, чтобы другим было хорошо.'
            ],
            [
                'group_name' => 'ego',
                'number' => 5,
                'text' => 'Любит учиться, преподносит себя как знающий. Любит, когда люди считают его умным и знающим. Самое обидное, когда его называют глупым. Искатели. Постоянно ищут истину, хотят знать ответы на все вопросы. Для Эго важно, чтобы его видели, как интеллектуально развитого человека, который знает ответы на все вопросы.'
            ],
            [
                'group_name' => 'ego',
                'number' => 6,
                'text' => 'Хочет быть идеальной(ым) во всем. Лучший специалист, лучшая мать(отец), выполняю работу самым наилучшим образом. Трудности в делегировании. Желание всегда хорошо выглядеть.'
            ],
            [
                'group_name' => 'ego',
                'number' => 7,
                'text' => 'Человеку хочется, чтобы люди видели его деятельным, в соответствии с духом времени, в тренде, полным свежих идей, с новым взглядом. Эго желает быть в трансформации.'
            ],
            [
                'group_name' => 'mental_body',
                'number' => 1,
                'text' => 'Сильный контроль ума. Сильный ум, который может мешать соединяться и принять Божественное. Ум хочет все контролировать, может быть категоричным, делить все на правильное и неправильное, создавать суждения и ограничения. Нужно выходить за пределы ума, т.к. ум может ограничивать возможности и не давать видеть их. Очень хорошо использовать мантру “Я соединяю свою Свободную волю с Божественной».'
            ],
            [
                'group_name' => 'mental_body',
                'number' => 2,
                'text' => 'Самый высокий потенциал в безусловной любви - научиться распознавать, принимать, соединяться со всем. Научиться получать. В согласии с Лучом, дает хорошую интуицию, вибрации любви в уме. В сопротивлении к Лучу, вы можете не принимать идеи других, если они не совпадают с вашими убеждениями.'
            ],
            [
                'group_name' => 'mental_body',
                'number' => 3,
                'text' => 'Новые креативные идеи, возможности, творчество. Беспокойство по поводу выбора. Надежда на всех кроме себя. Видят возможности и знают, как их реализовать. Практичность, возможности применения. Хорошо медитировать.'
            ],
            [
                'group_name' => 'mental_body',
                'number' => 4,
                'text' => 'Человек хочет находиться в мире, не в конфликте. Желание избежать конфликта. Это конфликт в голове, накручивание, возможен хаос в мыслях. Человека обязательно проведут через этот опыт для познания себя, дадут возможность научиться находить свой путь к гармонии. Это очень ценный опыт для Души.'
            ],
            [
                'group_name' => 'mental_body',
                'number' => 5,
                'text' => 'Человек любит познавать новое, обучаться, проходить различные тренинги, слушать лекции. Ум всегда говорит, что надо получать ответы на вопросы. Соединение с 5-м лучом – это доверие своей интуиции. Можно получать все знания, соединившись с высшим разумом, с интуицией. Задача-доверять, верить себе, своей интуиции.'
            ],
            [
                'group_name' => 'mental_body',
                'number' => 6,
                'text' => 'Человек ищет совершенство во всем. Верит в то, что мы должны быть совершенными, чтобы быть Божественными. Закрывает ум от сознания Божественного источника. Есть убеждения, которые создают разделение.'
            ],
            [
                'group_name' => 'mental_body',
                'number' => 7,
                'text' => 'Переменчивые мысли, гибкий ум, может подстраиваться под разные системы мышления, быстро усваивает информацию, постоянно в процессе познания нового, в поиске новых идей, ответов на вопросы. С одной стороны, это гибкость ума, но с другой возможен хаос в голове, сегодня одно, завтра другое, послезавтра третье. Если не в сонастроенности с лучом, страх меняться, депрессии, страх идти дальше, ступор, страх непонятно чего.'
            ]
            

            
        ]);

    }
}
